Практос_2/src/Documents/СписаниеСредствНаПодбор/СписаниеСредствНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСредствНаПодбор</name>
  <registerRecords>AccumulationRegister.ПоступленияДС</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаПодбор</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договр</name>
    <type>
      <types>DocumentRef.Договор</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>Вакансия</name>
      <type>
        <types>CatalogRef.Вакансии</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратНаПодбор</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Рубли</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Практос_2/src/AccumulationRegisters/ЗатратыНаПодбор/ЗатратыНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаПодбор</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗатратыНаПодбор</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратНаПодбор</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практос_2/src/AccumulationRegisters/ПоступленияДС/ПоступленияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПоступленияДС</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Рубли</types>
    </type>
  </resources>
  <attributes>
    <name>СписаниеСредствНаПодбор</name>
    <type>
      <types>DocumentRef.СписаниеСредствНаПодбор</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DocumentRef.Договор</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практос_2/src/Documents/СписаниеСредствНаПодбор/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗатратыНаПодбор Расход
	Движения.ЗатратыНаПодбор.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ЗатратыНаПодбор.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗатратыНаПодбор = ТекСтрокаЗатраты.Вакансия;
		Движение.СтатьяЗатрат = ТекСтрокаЗатраты.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	// регистр ПоступленияДС Расход
	Движения.ПоступленияДС.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ПоступленияДС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договр;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
		Движение.СписаниеСредствНаПодбор = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
